{
  "Education": [
    {
      "year": "SMKN 1 Majalengka 2010-2013",
      "title": "Senior High School",
      "subtitle": "Software engineering(Rekayasa Perangkat Lunak)",
      "iconClass": "fa-solid fa-school"
    },
    {
      "year": "University of Majalengka 2015-2020",
      "title": "Bachelor degree",
      "subtitle": "Informatics Engineering(Teknik Informatika)",
      "iconClass": "fa-solid fa-user-graduate"
    }
  ],
  "Work Experience": [
    {
      "year": "PT. Danamon Mei 2020 - Mei 2021",
      "title": "Software Developer",
      "subtitle": "<ul><li>Created application to simplify work in the transaction banking division</li><li>Participated in software design and development meetings to ensure quality assurance goals are met</li><li>Collaborated with developers to ensure timely resolution of software defects</li><li>Created and maintained detailed test reports to provide stakeholders with an overview of test results</li><li>Performed manual testing to ensure software compatibility with multiple platforms and devices</li></ul>",
      "iconClass": "fa-solid fa-briefcase"
    },
    {
      "year": "PT. ILCS Jun 2021 - Sep 2022",
      "title": "Software Engineer",
      "subtitle": "<ul><li>Simplifying complex processes, such as developing applications for transaction banking and vessel monitoring.</li><li>Created an application that can control and supervise ships that will dock at the port of Indonesia in collaboration with the company Pelindo.</li><li>Create an application for ship captains and crew so that the tower will get the latest updates from the journey to anchor the ship.</li></ul",
      "iconClass": "fa-solid fa-briefcase"
    },
    {
      "year": "PT. CIMB Niaga since Oct 2022",
      "title": "Frontend Developer",
      "subtitle": "<ul><li>Developed a custom UI library that increased developer productivity and code reuse.</li><li>Implemented a single-page application using React and Redux that improved overall performance and usability.</li><li>Utilized HTML, CSS, and JavaScript to create a dynamic, interactive user interface that improved user experience.</li><li>Enhanced existing applications by adopting best practice concepts.</li></ul>",
      "iconClass": "fa-solid fa-briefcase"
    }
  ]
}
